Revit 2026 API

# DWFExportOptionsCropBoxVisible Property

---

Whether to export crop box.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CropBoxVisible { get; set; }
```
```vb
Public Property CropBoxVisible As Boolean
	Get
	Set
```
```cpp
public:
property bool CropBoxVisible {
	bool get ();
	void set (bool value);
}
```
```fsharp
member CropBoxVisible : bool with get, set
```

#### Property Value

Boolean

The default value is false.

#### Reference

DWFExportOptions Class

Autodesk.Revit.DB Namespace